# FabricationInsulationSpecificationAbbreviation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationInsulationSpecificationAbbreviation Property
ParameterTypeId Class See Also
---
"Insulation Specification Abbreviation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationInsulationSpecificationAbbreviation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationInsulationSpecificationAbbreviation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationInsulationSpecificationAbbreviation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace